Adyen.Test/mocks/terminalapi/repeated-response-message.json

{
   "SaleToPOIResponse":{
      "TransactionStatusResponse":{
         "Response":{
            "Result":"Success"
         },
         "RepeatedMessageResponse":{
            "RepeatedResponseMessageBody":{
               "ReversalResponse":{
                  "POIData":{
                     "POITransactionID":{
                        "TimeStamp":"2020-06-01T06:31:59.361Z",
                        "TransactionID":"883590993111199C"
                     }
                  },
                  "PaymentReceipt":[
                     {
                        "DocumentQualifier":"CashierReceipt",
                        "OutputContent":{
                           "OutputFormat":"Text",
                           "OutputText":[
                              {
                                 "CharacterStyle":"Bold",
                                 "Text":"key=header1",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "CharacterStyle":"Bold",
                                 "Text":"key=header2",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "CharacterStyle":"Bold",
                                 "Text":"name=MERCHANT%20COPY&key=merchantTitle",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "Text":"name=Time&value=07%3a31%3a58&key=txtime",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "Text":"name=Date&value=01%2f06%2f2020&key=txdate",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "Text":"name=TID&value=P400Plus-123456789&key=tid",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "Text":"name=PTID&value=123456789&key=ptid",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "Text":"name=Entry%20mode&value=Contactless%20chip&key=posEntryMode",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "Text":"name=Card&value=%2a%2a%2a%2a%2a%2a%2a%2a%2a%2a%2a%123456&key=pan",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "Text":"name=Tender&value=57fa001590993094321&key=txRef",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "Text":"name=Type&value=GOODS_SERVICES&key=txtype",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "CharacterStyle":"Bold",
                                 "Text":"name=TOTAL&value=%e2%82%ac%203.00&key=totalAmount",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "Text":"key=filler",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "Text":"key=filler",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "Text":"key=filler",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "Text":"key=filler",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "CharacterStyle":"Bold",
                                 "Text":"name=%2aVOID%20REQUESTED%2a&key=void",
                                 "EndOfLineFlag":true
                              }
                           ]
                        }
                     },
                     {
                        "DocumentQualifier":"CustomerReceipt",
                        "OutputContent":{
                           "OutputFormat":"Text",
                           "OutputText":[
                              {
                                 "CharacterStyle":"Bold",
                                 "Text":"key=header1",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "CharacterStyle":"Bold",
                                 "Text":"key=header2",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "CharacterStyle":"Bold",
                                 "Text":"name=CARDHOLDER%20COPY&key=cardholderHeader",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "Text":"name=Time&value=07%3a31%3a58&key=txtime",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "Text":"name=Date&value=01%2f06%2f2020&key=txdate",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "Text":"name=TID&value=P400Plus-123456789&key=tid",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "Text":"name=PTID&value=123456789&key=ptid",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "Text":"name=Entry%20mode&value=Contactless%20chip&key=posEntryMode",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "Text":"name=Card&value=%2a%2a%2a%2a%2a%2a%2a%2a%2a%2a%2a%2a9999&key=pan",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "Text":"name=Tender&value=57fa001590993094321&key=txRef",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "Text":"name=Type&value=GOODS_SERVICES&key=txtype",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "CharacterStyle":"Bold",
                                 "Text":"name=TOTAL&value=%e2%82%ac%203.00&key=totalAmount",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "Text":"key=filler",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "Text":"key=filler",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "Text":"key=filler",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "Text":"key=filler",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "Text":"key=filler",
                                 "EndOfLineFlag":true
                              },
                              {
                                 "CharacterStyle":"Bold",
                                 "Text":"name=%2aVOID%20REQUESTED%2a&key=void",
                                 "EndOfLineFlag":true
                              }
                           ]
                        }
                     }
                  ],
                  "Response":{
                     "Result":"Success",
                     "AdditionalResponse":"tid=75701234&transactionType=GOODS_SERVICES&backendGiftcardIndicator=false&posadditionalamounts.originalAmountValue=300&posAmountGratuityValue=0&giftcardIndicator=false&pspReference=883590993111234C&txtime=07%3a31%3a58&iso8601TxDate=2020-06-01T06%3a31%3a58.0000000%2b0000&posOriginalAmountValue=300&txdate=01-06-2020&paymentMethod=mc&transactionReferenceNumber=88359099311234C&cardSummary=1234&posadditionalamounts.originalAmountCurrency=EUR&posAuthAmountCurrency=EUR&posAmountCashbackValue=0&posEntryMode=CLESS_CHIP&cardBin=%2a%2a%2a%2a%2a%2a&posAuthAmountValue=300"
                  }
               }
            },
            "MessageHeader":{
               "ProtocolVersion":"3.0",
               "SaleID":"1",
               "MessageClass":"Service",
               "MessageCategory":"Reversal",
               "ServiceID":"1234500081",
               "POIID":"P400Plus-123456789",
               "MessageType":"Response"
            }
         }
      },
      "MessageHeader":{
         "ProtocolVersion":"3.0",
         "SaleID":"1",
         "MessageClass":"Service",
         "MessageCategory":"TransactionStatus",
         "ServiceID":"1234500081",
         "POIID":"P400Plus-123456789",
         "MessageType":"Response"
      }
   }
}